Revit 2021.1 API
UnitUtils.GetTypeCatalogString Method (DisplayUnitType)
 Gets the string used in type catalogs to identify a given display unit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
Since: 2014
Syntax
C#
[ObsoleteAttribute("This method is deprecated in Revit 2021 and may be removed in a future version of Revit. Please use the `GetTypeCatalogStringForUnit(ForgeTypeId)` method instead.")]
public static string GetTypeCatalogString(
	DisplayUnitType displayUnit
)
Visual Basic
<ObsoleteAttribute("This method is deprecated in Revit 2021 and may be removed in a future version of Revit. Please use the `GetTypeCatalogStringForUnit(ForgeTypeId)` method instead.")> _
Public Shared Function GetTypeCatalogString ( _
	displayUnit As DisplayUnitType _
) As String
Visual C++
[ObsoleteAttribute(L"This method is deprecated in Revit 2021 and may be removed in a future version of Revit. Please use the `GetTypeCatalogStringForUnit(ForgeTypeId)` method instead.")]
public:
static String^ GetTypeCatalogString(
	DisplayUnitType displayUnit
)
Parameters
displayUnit
Type: Autodesk.Revit.DB.DisplayUnitType
 The display unit.
Return Value
 The type catalog string, or an empty string if the display unit cannot be used in type catalogs.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
UnitUtils Class
GetTypeCatalogString Overload
Autodesk.Revit.DB Namespace